app/controllers/admins_controller.rb

  def data
    @users = User.all()
---
SELECT "users".* FROM "users" WHERE "users"."uid" = 2510948 LIMIT 1

  def dbaction
    #called for all db actions
    uid = params["c0"]
    nickname = params["c1"]
    email = params["c2"]
    admin = params["c3"]

    @mode = params["!nativeeditor_status"]

    @id = params["gr_id"]
    case @mode
    when "inserted"
      user = User.new
      user.uid = uid
      user.nickname = nickname
      user.email = email
      user.admin = admin
      user.save!

      @tid = user.id
    when "deleted"
      user=User.find(@id)
      user.destroy
---
INSERT INTO "users" ("admin", "created_at", "email", "nickname", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["admin", nil], ["created_at", Thu, 06 Dec 2012 14:08:18 UTC +00:00], ["email", ""], ["nickname", ""], ["uid", 0], ["updated_at", Thu, 06 Dec 2012 14:08:18 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

      user.nickname = nickname
      user.email = email
      user.admin = admin
      user.save!
---
UPDATE "users" SET "uid" = 0, "nickname" = 'e21e21e', "updated_at" = '2012-12-12 15:31:09.505049' WHERE "users"."id" = 11