app/controllers/sessions_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']
    user = User.find_all_by_uid_and_nickname(auth_hash["uid"],auth_hash["info"]["nickname"]);
    session["uid"]=auth_hash["uid"]
    if user.count > 0
      render :text => "Welcome back! You have already signed up."
    else
      user = User.new :uid => auth_hash["uid"], :nickname=> auth_hash["info"]["nickname"], :email =>auth_hash["info"]["email"], :admin => false
      user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = 213421 AND "users"."nickname" = 'blabla'
INSERT INTO "users" ("admin", "created", "created_at", "email", "nickname", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)