app/controllers/surveys_controller.rb

  def show
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @survey = Survey.new(params[:survey])
    for question in @survey.questions
      for answer in question.answers
        answer.votes=0
      end
    end
    if @survey.save
---
INSERT INTO "questions" ("content", "created_at", "survey_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wdawd"], ["created_at", Wed, 12 Dec 2012 16:41:42 UTC +00:00], ["survey_id", 2], ["updated_at", Wed, 12 Dec 2012 16:41:42 UTC +00:00]]
INSERT INTO "surveys" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 12 Dec 2012 16:19:36 UTC +00:00], ["name", ""], ["updated_at", Wed, 12 Dec 2012 16:19:36 UTC +00:00]]

  def update
    @survey = Survey.find(params[:id])
    if @survey.update_attributes(params[:survey])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "surveys" SET "name" = 'chuj', "updated_at" = '2012-12-12 16:20:04.103794' WHERE "surveys"."id" = 1

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 1]]