app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."uid" = 2510948

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "created", "created_at", "email", "nickname", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "admin" = 't', "created" = '2012-12-04', "updated_at" = '2012-12-04 17:10:48.697092' WHERE "users"."id" = 2